from konlpy.tag import Okt


okt = Okt()


# 감정분석 불용어
stopwords_sentiment = [
    '의', '가', '이', '은', '는',
    '을', '를', '에', '도',
    '와', '과', '로', '으로',
    '에서', '에게', '한테',

    '하다', '되다', '있다',
    '없다', '이다',

    '그', '이', '저',
    '것', '수',

    '너무', '진짜', '정말',
    '완전', '엄청', '아주',
    '되게', '약간', '조금',
    '그냥', '좀'
]


# 키워드추출 불용어
stopwords_keyword = [
    '완전', '엄청',
    '되게', '약간',
    '조금', '그냥', '좀',

    '장면', '부분',
    '내용', '느낌',
    '처음', '마지막',
    '중간',

    '보고', '봤다',
    '보는', '보니',
    '보면', '봤는데',

    '좋다', '나쁘다',
    '재밌다', '재미있다',
    '별로', '최고', '최악',

    '같다', '싶다',
    '사람', '관객',

    '평점', '리뷰',

    'ㅋㅋ', 'ㅎㅎ',
    'ㅠㅠ', 'ㅜㅜ',
    'ㄷㄷ',

    '상미', '격감', '정선',
    '미가', '두운'
]


# 추천 불용어
stopwords_recommend = [
    '의', '가', '이', '은', '는',
    '을', '를', '에', '도',
    '와', '과', '로', '으로',
    '에서', '에게', '한테',

    '하다', '되다', '있다',
    '없다', '이다',

    '그', '이', '저',
    '것', '수',

    '사람',
    '인간',
    '이야기',
    '영화',
    '시작',
    '과정',
    '위해'
]


# 키워드 단어 사전 필터링
movie_keywords = [
    '영상미',
    '연출',
    '스토리',
    '반전',
    '몰입감',
    '긴장감',
    '음악',
    'ost',
    '액션',
    '연기력',
    '배우',
    '세계관',
    '감동',
    '분위기',
    '서사',
    '캐릭터',
    '전개',
    '결말',
    '엔딩',
    '여운'
]